In [38]:
import pandas as pd
import numpy as np

In [39]:
from sklearn.feature_extraction.text import CountVectorizer
from sklearn.feature_extraction import DictVectorizer

In [40]:
df = pd.read_csv('data\Merged-Formatted-Indian-Names.csv')
df

                  name gender
0              barjraj      m
1         ramdin verma      m
2      sharat chandran      m
3      birender mandal      m
4                 amit      m
...                ...    ...
30480          tasleem      u
30481           lovely      u
30482           kalpna      u
30483           ruksar      u
30484            pinki      u

[30485 rows x 2 columns]

In [41]:
df.dtypes

name      object
gender    object
dtype: object

In [42]:
df.isnull().isnull().sum()

name      0
gender    0
dtype: int64

In [43]:
df[df.gender == 'm'].size

29690

In [44]:
df[df.gender == 'f'].size

30764

In [45]:
df[df.gender == 'u'].size

516

In [46]:
df_names =df

In [47]:
df_names.gender.replace({'m':0, 'f':1, 'u':2}, inplace=True)

In [48]:
df_names.gender.unique()

array([0, 1, 2], dtype=int64)

In [49]:
df_names.dtypes

name      object
gender     int64
dtype: object

In [50]:
df_names

                  name  gender
0              barjraj       0
1         ramdin verma       0
2      sharat chandran       0
3      birender mandal       0
4                 amit       0
...                ...     ...
30480          tasleem       2
30481           lovely       2
30482           kalpna       2
30483           ruksar       2
30484            pinki       2

[30485 rows x 2 columns]